FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_SSP.c
/*-------------------------------------------------------------------------*
 * File:  SSP.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC17xx_40xx SSP Bus Interface.
 * Implementation:
 *      Two SSPs are created, SSP0 and SSP1 and SSP2.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://goo.gl/UDtTCR for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!  |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include "Config.h"
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <uEZPlatform.h>
#include <HAL/GPIO.h>
#include <HAL/Interrupt.h>
#include <Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_SSP.h>
#include "LPC17xx_40xx_UtilityFuncs.h"

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    TVUInt32 iCR0; // 0x00
#define SSP_FRF_SPI (0<<4)      // Frame format: SPI
#define SSP_FRF_TI  (1<<4)      // Frame format: TI
#define SSP_FRF_MW  (2<<4)      // Frame format: Microwire
#define SSP_CPOL    (1<<6)      // Clock Polarity
#define SSP_CPHA    (1<<7)      // Clock Phase
    TVUInt32 iCR1; // 0x04
#define SSP_LBM     (1<<0)      // Loop back mode
#define SSP_SSE     (1<<1)      // SSP Enable
#define SSP_MS      (1<<2)      // Master/Slave Mode (master=0)
#define SSP_SOD     (1<<3)      // Slave Output Disable
    TVUInt32 iDR; // 0x08
    TVUInt32 iSR; // 0x0C -- read only
#define SSP_TFE     (1<<0)      // Transmit FIFO Empty
#define SSP_TNF     (1<<1)      // Transmit FIFO Not Full
#define SSP_RNE     (1<<2)      // Receive FIFO Not Empty
#define SSP_RFF     (1<<3)      // Receive FIFO Full
#define SSP_BSY     (1<<4)      // Busy
    TVUInt32 iCPSR; // 0x10
    TVUInt32 iIMSC; // 0x14
#define SSP_RORIM   (1<<0)      // Receive overrun interrupt
#define SSP_RTIM    (1<<1)      // Receive timeout
#define SSP_RXIM    (1<<2)      // Rx FIFO is at least half full
#define SSP_TXIM    (1<<3)      // Tx FIFO is at least half empty
    TVUInt32 iRIS; // 0x18
#define SSP_RORRIS  (1<<0)      // Raw Receive overrun interrupt
#define SSP_RTRIS   (1<<1)      // Raw Receive timeout
#define SSP_RXRIS   (1<<2)      // Raw Rx FIFO is at least half full
#define SSP_TXRIS   (1<<3)      // Raw Tx FIFO is at least half empty
    TVUInt32 iMIS; // 0x1C
#define SSP_RORMIS  (1<<0)      // Mask (1=on) Receive overrun interrupt
#define SSP_RTMIS   (1<<1)      // Mask (1=on) Receive timeout
#define SSP_RXMIS   (1<<2)      // Mask (1=on) Rx FIFO is at least half full
#define SSP_TXMIS   (1<<3)      // Mask (1=on) Tx FIFO is at least half empty
    TVUInt32 iICR; // 0x20
#define SSP_RORIC   (1<<0)      // Clears SSP_RORIM interrupt
#define SSP_RTIC    (1<<1)      // Clears SSP_RTRIS interrupt
    TVUInt32 iDMACR;// 0x24
#define SSP_RXDMAE  (1<<0)      // When 1, DMA enabled for Rx FIFO
#define SSP_TXDMAE  (1<<1)      // When 1, DMA enabled for Tx FIFO
} T_LPC17xx_40xx_SSP_Registers;

typedef struct {
    const HAL_SPI *iHAL;
    T_LPC17xx_40xx_SSP_Registers *iReg;
    T_spiCompleteCallback iCompleteCallback;
    void *iCompleteCallbackWorkspace;
    SPI_Request *iRequest;
    T_irqChannel iIRQChannel;
    TBool iIsBusy;
    TUInt32 iLastRate;
} T_LPC17xx_40xx_SSP_Workspace;

/*---------------------------------------------------------------------------*
 * Function Prototypes:
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE( ISSP0IRQ );
IRQ_ROUTINE( ISSP1IRQ );
IRQ_ROUTINE( ISSP2IRQ );
static void ISSPEnd(SPI_Request *aRequest);
static void ISSPProcessInterrupt(T_LPC17xx_40xx_SSP_Workspace *aW);
static void ISSPOutput(T_LPC17xx_40xx_SSP_Workspace *aW);

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
static T_LPC17xx_40xx_SSP_Workspace *G_SSP0Workspace;
static T_LPC17xx_40xx_SSP_Workspace *G_SSP1Workspace;
static T_LPC17xx_40xx_SSP_Workspace *G_SSP2Workspace;

/*---------------------------------------------------------------------------*
 * Routine: ISSPxIRQ
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the SSPx interrupts and forward to ISSPProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE( ISSP0IRQ )
{
    IRQ_START();
    ISSPProcessInterrupt(G_SSP0Workspace);
    IRQ_END();
}

IRQ_ROUTINE( ISSP1IRQ )
{
    IRQ_START();
    ISSPProcessInterrupt(G_SSP1Workspace);
    IRQ_END();
}

IRQ_ROUTINE( ISSP2IRQ )
{
    IRQ_START();
    ISSPProcessInterrupt(G_SSP2Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine: ISSPProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Generic routine for handling any of the SSP interrupts.
 *      NOTE: This routine is ALWAYS processed inside of a interrupt
 *              service routine.
 * Inputs:
 *      T_SerialPortEntry *p      -- Port's definition to process interrupt
 *---------------------------------------------------------------------------*/
static void ISSPProcessInterrupt(T_LPC17xx_40xx_SSP_Workspace *aW)
{
    T_LPC17xx_40xx_SSP_Registers *p = aW->iReg;
    SPI_Request *r = aW->iRequest;
    TUInt8 ris;
    TUInt32 data;

    while (1) {
        // Do we have any interrupts to process now?
        ris = p->iMIS;
        if (!ris)
            break;

        // Is data waiting to be received?
        if (ris & (SSP_RTMIS | SSP_RXMIS)) {
            // Pull the data out of the SSP peripheral
            if (r->iNumTransferredIn < r->iNumTransfers) {
                data = p->iDR;
                if (r->iDataMISO)
                    ((TUInt8 *)r->iDataMISO)[r->iNumTransferredIn++] = data;
            }

            // If we have reached the end, we are done
            if (r->iNumTransferredIn >= r->iNumTransfers) {
                // No more processing.  Stop here.
                InterruptDisable(aW->iIRQChannel);

