FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_SSP.c
            // Store the SSP received over the data sent
            if (p_dataMISO8) {
                // Store the SSP received over the data sent
                if (((i + 4) <= aRequest->iNumTransfers) && (!isToggling)) {
                    // Do 4 at one time
                    *(p_dataMISO8++) = p->iDR;
                    *(p_dataMISO8++) = p->iDR;
                    *(p_dataMISO8++) = p->iDR;
                    *(p_dataMISO8++) = p->iDR;
                    i += 3;
                } else {
                    *(p_dataMISO8++) = p->iDR;
                }
            } else {
                // Store the SSP received over the data sent
                if (((i + 4) <= aRequest->iNumTransfers) && (!isToggling)) {
                    // Do 4 at one time
                    dummy = p->iDR;
                    dummy = p->iDR;
                    dummy = p->iDR;
                    dummy = p->iDR;
                    i += 3;
                } else {
                    dummy = p->iDR;
                }
            }
            if (isToggling) {
                ISSPEnd(aRequest);
            }
        }
    } else {
        // Doing words
        p_dataMOSI16 = (TUInt16 *)(aRequest->iDataMOSI);
        p_dataMISO16 = (TUInt16 *)(aRequest->iDataMISO);

        for (i = 0; i < aRequest->iNumTransfers; i++) {
            // Wait for SSP to be no longer busy and transmit to be empty
            while ((p->iSR & SSP_BSY) || (!(p->iSR & SSP_TFE))) {
                // TBD: Polling here instead of interrupt
            }

            // Send the SSP data (this also triggers a read in)
            if (p_dataMOSI16)
                p->iDR = (TUInt32)*(p_dataMOSI16++);
            else
                p->iDR = 0xFFFF;

            // Wait until SSP done
            while ((p->iSR & SSP_BSY) || ((p->iSR & SSP_TFE) == 0)) {
                // TBD: For polling this is fine, but we may need to yield at some point?
            }

            // Store the SSP received over the data sent
            if (p_dataMISO16)
                *(p_dataMISO16++) = p->iDR;
            else
                dummy = p->iDR;
        }
    }

    // End SSP
    ISSPEnd(aRequest);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_SSP_SSP0_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC17xx_40xx SSP0 workspace.
 * Inputs:
 *      void *aW                    -- Particular SSP workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_SSP_SSP0_InitializeWorkspace(void *aWorkspace)
{
    T_LPC17xx_40xx_SSP_Workspace *p = (T_LPC17xx_40xx_SSP_Workspace *)aWorkspace;
    p->iReg = (T_LPC17xx_40xx_SSP_Registers *)LPC_SSP0_BASE;

    G_SSP0Workspace = p;
    p->iIsBusy = EFalse;
    p->iIRQChannel = SSP0_IRQn;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_SSP_SSP1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC17xx_40xx SSP1 workspace.
 * Inputs:
 *      void *aW                    -- Particular SSP workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_SSP_SSP1_InitializeWorkspace(void *aWorkspace)
{
    T_LPC17xx_40xx_SSP_Workspace *p = (T_LPC17xx_40xx_SSP_Workspace *)aWorkspace;
    p->iReg = (T_LPC17xx_40xx_SSP_Registers *)LPC_SSP1_BASE;

    G_SSP1Workspace = p;
    p->iIsBusy = EFalse;
    p->iIRQChannel = SSP1_IRQn;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_SSP_SSP2_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC17xx_40xx SSP2 workspace.
 * Inputs:
 *      void *aW                    -- Particular SSP workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_SSP_SSP2_InitializeWorkspace(void *aWorkspace)
{
    T_LPC17xx_40xx_SSP_Workspace *p = (T_LPC17xx_40xx_SSP_Workspace *)aWorkspace;
    p->iReg = (T_LPC17xx_40xx_SSP_Registers *)LPC_SSP2_BASE;

    G_SSP2Workspace = p;
    p->iIsBusy = EFalse;
    p->iIRQChannel = SSP2_IRQn;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_SSP_Start
 *---------------------------------------------------------------------------*
 * Description:
 *      Start a SSP transfer by putting the chip select in the active state
 *      after configuring the SSP speed and other settings.
 * Inputs:
 *      void *aW                    -- Particular SSP workspace
 *      SPI_Request *aRequest       -- SSP request being processed
 *---------------------------------------------------------------------------*/
void LPC17xx_40xx_SSP_Start(void *aWorkspace, SPI_Request *aRequest)
{
    // Setup SSP for this configuration
    ISSPConfig(aWorkspace, aRequest);
    ISSPStart(aRequest);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_SSP_TransferInOut
 *---------------------------------------------------------------------------*
 * Description:
 *      Do a single SSP transfer to the SSP device.
 * Inputs:
 *      void *aW                    -- Particular SSP workspace
 *      SPI_Request *aRequest       -- SSP request being processed
 *      TUInt32 aSend               -- Item to transfer
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static TUInt32 LPC17xx_40xx_SSP_TransferInOut(
        void *aWorkspace,
        SPI_Request *aRequest,
        TUInt32 aSend)
{
    TUInt32 recv;
    T_LPC17xx_40xx_SSP_Workspace *aW = (T_LPC17xx_40xx_SSP_Workspace *)aWorkspace;
    T_LPC17xx_40xx_SSP_Registers *p = aW->iReg;

