FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_SSP.c
    // Are we transferring byte sized or word sized?
    if (aRequest->iBitsPerTransfer <= 8) {
        // Send the SSP data (this also triggers a read in)
        p->iDR = aSend;

        // Wait until SSP done
        while (((p->iSR & SSP_TFE) == 0) || (p->iSR & SSP_BSY)) {
            // TBD: For polling this is fine, but we may need to yield at some point?
        }

        // Store the SSP received over the data sent
        recv = p->iDR;
    } else {
        // Send the SSP data (this also triggers a read in)
        p->iDR = (TUInt32)*((TUInt16 *)aSend);

        // Wait until SSP done
        while ((p->iSR & SSP_RNE) == 0) {
            // TBD: For polling this is fine, but we may need to yield at some point?
        }

        // Store the SSP received over the data sent
        recv = p->iDR;
    }

    return recv;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_SSP_Stop
 *---------------------------------------------------------------------------*
 * Description:
 *      End a SSP transfer by putting the chip select in the done state.
 * Inputs:
 *      void *aW                    -- Particular SSP workspace
 *      SPI_Request *aRequest       -- SSP request being processed
 *---------------------------------------------------------------------------*/
static void LPC17xx_40xx_SSP_Stop(void *aWorkspace, SPI_Request *aRequest)
{
    ISSPEnd(aRequest);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_SSP_SSP1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Transfer a set of SSP bytes (in the request) to the given
 *      target.  Works similarly to TransferPolled except this routine
 *      does not affect the chip select state.
 * Inputs:
 *      void *aW                    -- Particular SSP workspace
 *      SPI_Request *aRequest       -- SSP request being processed
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError LPC17xx_40xx_SSP_TransferInOutBytes(
        void *aWorkspace,
        SPI_Request *aRequest)
{
    T_LPC17xx_40xx_SSP_Workspace *aW = (T_LPC17xx_40xx_SSP_Workspace *)aWorkspace;
    T_LPC17xx_40xx_SSP_Registers *p = aW->iReg;
    TUInt32 sent;
    TUInt32 count;
    TUInt8 *p_dataMOSI = (TUInt8 *)aRequest->iDataMOSI;
    TUInt8 *p_dataMISO = (TUInt8 *)aRequest->iDataMISO;
    TUInt8 dummy[8];

    // This routine only works with transfer of 8 bits or lower
    if (aRequest->iBitsPerTransfer > 8)
        return UEZ_ERROR_INVALID_PARAMETER;

    sent = 0;
    count = aRequest->iNumTransfers;

    // Send data while there is data to send
    while (sent < count) {
        if (!aRequest->iDataMISO)
            p_dataMISO = dummy;

        // Always send in groups of 8 bytes if there are 8 bytes to send
        if ((sent + 8) <= count) {
            // Send 8
            if (!aRequest->iDataMOSI) {
                p->iDR = 0xFF;
                p->iDR = 0xFF;
                p->iDR = 0xFF;
                p->iDR = 0xFF;
                p->iDR = 0xFF;
                p->iDR = 0xFF;
                p->iDR = 0xFF;
                p->iDR = 0xFF;
            } else {
                p->iDR = *(p_dataMOSI++);
                p->iDR = *(p_dataMOSI++);
                p->iDR = *(p_dataMOSI++);
                p->iDR = *(p_dataMOSI++);
                p->iDR = *(p_dataMOSI++);
                p->iDR = *(p_dataMOSI++);
                p->iDR = *(p_dataMOSI++);
                p->iDR = *(p_dataMOSI++);
            }

            // Wait until SSP done
            while (((p->iSR & SSP_TFE) == 0) || (p->iSR & SSP_BSY)) {
                // TBD: For polling this is fine, but we may need to yield at some point? // Staying here a lot during boot!
            }

            // Receive 8
            *(p_dataMISO++) = p->iDR;
            *(p_dataMISO++) = p->iDR;
            *(p_dataMISO++) = p->iDR;
            *(p_dataMISO++) = p->iDR;
            *(p_dataMISO++) = p->iDR;
            *(p_dataMISO++) = p->iDR;
            *(p_dataMISO++) = p->iDR;
            *(p_dataMISO++) = p->iDR;

            sent += 8;
        } else {
            // There are now less than 8 bytes to send, send
            // one at a time.

            // Send 1
            if (!aRequest->iDataMOSI) {
                p->iDR = 0xFF;
            } else {
                p->iDR = *(p_dataMOSI++);
            }
            // Wait until SSP done
            while (((p->iSR & SSP_TFE) == 0) || (p->iSR & SSP_BSY)) {
                // TBD: For polling this is fine, but we may need to yield at some point?
            }

            // Receive 1
            *(p_dataMISO++) = p->iDR;

            sent++;
        }
    }

    return UEZ_ERROR_NONE;
}

static void ISSPOutput(T_LPC17xx_40xx_SSP_Workspace *aW)
{
    T_LPC17xx_40xx_SSP_Registers *p = aW->iReg;
    SPI_Request *r = aW->iRequest;
    TUInt32 num;
    TUInt8 *p_dataMOSI8;

    // Is there any room to send data?
    num = r->iNumTransfers - r->iNumTransferredOut;
    if (r->iDataMOSI) {
        // Output bytes from the array
        if (num >= 4) {
            p_dataMOSI8 = ((TUInt8 *)r->iDataMOSI) + r->iNumTransferredOut;
            p->iDR = p_dataMOSI8[0];
            p->iDR = p_dataMOSI8[1];
            p->iDR = p_dataMOSI8[2];
            p->iDR = p_dataMOSI8[3];
            r->iNumTransferredOut+=4;
        } else if (num) {
            // Output all we got left
            p_dataMOSI8 = ((TUInt8 *)r->iDataMOSI) + r->iNumTransferredOut;
            while (num--) {
                p->iDR = *(p_dataMOSI8++);
                r->iNumTransferredOut++;
            }
        } else {
            // No longer report interrupts for room to transfer,
            // we are out of bytes to transfer.
            p->iIMSC &= ~(SSP_TXIM);
        }
    } else {
        // Output 0xFF's
        if (num >= 4) {
            // Output 4 in a bunch
            p->iDR = 0xFF;
            p->iDR = 0xFF;
            p->iDR = 0xFF;
            p->iDR = 0xFF;
            r->iNumTransferredOut += 4;
        } else if (num) {
            // Output the remaining
            while (num--) {
                p->iDR = 0xFF;
                r->iNumTransferredOut++;
            }
        } else {
            // There is no more to output, stop doing interrupts
            // from the TXIM
            p->iIMSC &= ~(SSP_TXIM);
        }
    }
}

static T_uezError LPC17xx_40xx_SSP_TransferNoBlock(
        void *aWorkspace,
        SPI_Request *aRequest,
        T_spiCompleteCallback aCallback,
        void *aCallbackWorkspace)
{
    T_LPC17xx_40xx_SSP_Workspace *aW = (T_LPC17xx_40xx_SSP_Workspace *)aWorkspace;
    T_LPC17xx_40xx_SSP_Registers *p = aW->iReg;

    // This routine only works with transfer of 8 bits or lower
    if (aRequest->iBitsPerTransfer > 8)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Disable any potential SSP interrupts
    InterruptDisable(aW->iIRQChannel);

    aRequest->iNumTransferredOut = 0;
    aRequest->iNumTransferredIn = 0;

    // Setup the callback and the parameters
    aW->iCompleteCallback = aCallback;
    aW->iCompleteCallbackWorkspace = aCallbackWorkspace;
    aW->iRequest = aRequest;

    // Setup SSP for this configuration
    ISSPConfig(aW, aRequest);

    // Start SSP
    ISSPStart(aRequest);

